; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v5 ?v2)
             (pred_1 ?v12 ?v8)
             (pred_6 ?v5 ?v8)
             (pred_10 ?v4 ?v5 )
	     (pred_8 ?v5)
             (pred_12 ?v10)
             (pred_4 ?v12)
             (pred_2 ?v8)
             (pred_7 ?v5)
             (pred_5 ?v12)
             (pred_9 ?v5)
             (pred_11 ))



(:action op_3
:parameters (?v11 ?v9 ?v13 ?v7)
:precondition (and (pred_12 ?v11) (pred_12 ?v9) (pred_4 ?v13) (pred_2 ?v7)
          (pred_3 ?v11 ?v9) (pred_1 ?v13 ?v7)
                   (pred_6 ?v9 ?v7) (pred_8 ?v11) 
                   (pred_7 ?v9) (pred_5 ?v13))
:effect (and  (pred_9 ?v9) (not (pred_7 ?v9))))


(:action op_5
:parameters (?v11 ?v6)
:precondition (and (pred_12 ?v11) (pred_12 ?v6)
               (pred_8 ?v11) (pred_3 ?v11 ?v6) (pred_9 ?v6))
:effect (and (pred_8 ?v6) (not (pred_8 ?v11))))

(:action op_1
:parameters (?v11 ?v13)
:precondition (and (pred_12 ?v11) (pred_4 ?v13) 
                  (pred_8 ?v11) (pred_10 ?v13 ?v11) (pred_11 ))
:effect (and (pred_5 ?v13)
   (not (pred_10 ?v13 ?v11)) (not (pred_11 ))))


(:action op_4
:parameters (?v11 ?v3 ?v1)
:precondition (and (pred_12 ?v11) (pred_4 ?v3) (pred_4 ?v1)
                  (pred_8 ?v11) (pred_5 ?v1) (pred_10 ?v3 ?v11))
:effect (and (pred_5 ?v3) (pred_10 ?v1 ?v11)
        (not (pred_5 ?v1)) (not (pred_10 ?v3 ?v11))))

(:action op_2
:parameters (?v11 ?v13)
:precondition (and (pred_12 ?v11) (pred_4 ?v13) 
                  (pred_8 ?v11) (pred_5 ?v13))
:effect (and (pred_11 ) (pred_10 ?v13 ?v11) (not (pred_5 ?v13)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_01 obj_06 obj_03 obj_11 obj_08 obj_05 obj_13 obj_04
    obj_02 obj_07
    obj_10 obj_09
    )

    (:init
       (pred_11)

       (pred_12 obj_12)
       (pred_12 obj_01)
       (pred_12 obj_06)
       (pred_12 obj_03)
       (pred_12 obj_11)
       (pred_12 obj_08)
       (pred_12 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_04)
       (pred_2 obj_02)
       (pred_2 obj_07)
       (pred_4 obj_10)
       (pred_4 obj_09)

       (pred_3 obj_12 obj_03)
       (pred_3 obj_12 obj_01)
       (pred_3 obj_01 obj_11)
       (pred_3 obj_01 obj_06)
       (pred_3 obj_01 obj_12)
       (pred_3 obj_06 obj_08)
       (pred_3 obj_06 obj_01)
       (pred_3 obj_03 obj_05)
       (pred_3 obj_03 obj_11)
       (pred_3 obj_03 obj_12)
       (pred_3 obj_11 obj_13)
       (pred_3 obj_11 obj_08)
       (pred_3 obj_11 obj_01)
       (pred_3 obj_11 obj_03)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_08 obj_06)
       (pred_3 obj_08 obj_11)
       (pred_3 obj_05 obj_13)
       (pred_3 obj_05 obj_03)
       (pred_3 obj_13 obj_04)
       (pred_3 obj_13 obj_11)
       (pred_3 obj_13 obj_05)
       (pred_3 obj_04 obj_08)
       (pred_3 obj_04 obj_13)
       (pred_7 obj_08)
       (pred_7 obj_11)
       (pred_6  obj_08 obj_02)
       (pred_6  obj_11 obj_07)
       (pred_9 obj_12)
       (pred_9 obj_01)
       (pred_9 obj_06)
       (pred_9 obj_03)
       (pred_9 obj_05)
       (pred_9 obj_13)
       (pred_9 obj_04)

       (pred_1  obj_10 obj_02)
       (pred_1  obj_09 obj_07)
       (pred_10 obj_10 obj_12)
       (pred_10 obj_09 obj_04)
       (pred_8 obj_04)
    )

    (:goal (and
       (pred_10 obj_10 obj_01)
       (pred_10 obj_09 obj_05)
    ))
(:constraints
  (always (not (pred_8 obj_08)))
)
)

; plan
1. (op_5 obj_04 obj_13)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_13)
   goals met: 0 of 2
2. (op_5 obj_13 obj_05)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_05)
   goals met: 0 of 2
3. (op_5 obj_05 obj_03)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_03)
   goals met: 0 of 2
4. (op_5 obj_03 obj_12)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_12)
   goals met: 0 of 2
5. (op_1 obj_12 obj_10)
   deleted: (pred_10 obj_10 obj_12) (pred_11)
   added: (pred_5 obj_10)
   goals met: 0 of 2
6. (op_5 obj_12 obj_03)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_03)
   goals met: 0 of 2
7. (op_5 obj_03 obj_05)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_05)
   goals met: 0 of 2
8. (op_5 obj_05 obj_13)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_13)
   goals met: 0 of 2
9. (op_5 obj_13 obj_04)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_04)
   goals met: 0 of 2
10. (op_4 obj_04 obj_09 obj_10)
   deleted: (pred_5 obj_10) (pred_10 obj_09 obj_04)
   added: (pred_5 obj_09) (pred_10 obj_10 obj_04)
   goals met: 0 of 2
11. (op_5 obj_04 obj_13)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_13)
   goals met: 0 of 2
12. (op_3 obj_13 obj_11 obj_09 obj_07)
   deleted: (pred_7 obj_11)
   added: (pred_9 obj_11)
   goals met: 0 of 2
13. (op_5 obj_13 obj_05)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_05)
   goals met: 0 of 2
14. (op_2 obj_05 obj_09)
   deleted: (pred_5 obj_09)
   added: (pred_11) (pred_10 obj_09 obj_05)
   goals met: 1 of 2
15. (op_5 obj_05 obj_13)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_13)
   goals met: 1 of 2
16. (op_5 obj_13 obj_04)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_04)
   goals met: 1 of 2
17. (op_1 obj_04 obj_10)
   deleted: (pred_10 obj_10 obj_04) (pred_11)
   added: (pred_5 obj_10)
   goals met: 1 of 2
18. (op_5 obj_04 obj_13)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_13)
   goals met: 1 of 2
19. (op_5 obj_13 obj_11)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_11)
   goals met: 1 of 2
20. (op_5 obj_11 obj_01)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_01)
   goals met: 1 of 2
21. (op_2 obj_01 obj_10)
   deleted: (pred_5 obj_10)
   added: (pred_11) (pred_10 obj_10 obj_01)
   goals met: 2 of 2
